/*
 * boot.h
 *
 *  Created on: 2026年4月17日
 *      Author: Eloise
 *     Project: S32K142_CAN_APP
 *       Brief: 【 】
 *       Note : 1. 适配芯片：S32K142_64
 *              2. 编码格式：UTF-8
 *              3. 编译环境：S32DS 3.4 + GCC 7.2.1
 */

#ifndef APP_BOOTLOADER_EXCHANGE_INFO_BOOT_BOOT_H_
#define APP_BOOTLOADER_EXCHANGE_INFO_BOOT_BOOT_H_

#include "boot_cfg.h"



/*******************************************************************************
 * Definitions
 ******************************************************************************/


/*******************************************************************************
 * API
 ******************************************************************************/
 
/*! @}*/

/*request bootloader mode check*/
extern boolean Boot_CheckDownlaodAPPStatus(void);




#endif /* BOOT_H */
/*******************************************************************************
 * EOF
 ******************************************************************************/
